commands_list_postfix = f'''Прочие команды:<br>
фракция - генерирует случайную фракцию из героев 5
д* - генерирует случайное число в диапазоне от 1 до указанного числа
что такое* - отвечает первыми тремя предложениями из википедии
мут* - удаляет все новые сообщения этого пользователя(только для админов)
размут* - выключает мут для этого пользователя(только для админов)
добавить команду помощь - показывает информацию о добавлении команд
рарити - отправляет случайную рарити
абоба - абоба
команды - показывает полный список команд'''
commands_add_help = '''добавить команду (тип ответа)(_) (запрос): (ответ)
например: добавить команду текст_ амогус: тутуту
нижнее подчеркивание нужно добавить если вы хотите, 
чтобы команда писалась в случае если запрос содержится 
в сообщении, а не целиком его составляла в случае ответа
для гиф или изображения нужен его url, для стикера id 
типы команд: текст, гиф, изображение, стикер'''
