# text response
zmiysphrases = [
    'эно как',
    'тюй блин',
    'понял, спасибо',
    'кто былое помянет у того хрен отвянет',
    'тут не поспоришь',
    'не ну так-то да',
    'ясненько',
    'сбылась мечта',
    'мечта',
    'сбылась мечта идиота',
    'не ну а чо',
    'хап тьфу',
    'ужас',
    'кошмар',
    'не ну такое',
]

heroscities = [
    'орден порядка',
    'инферно',
    'лесной союз',
    'некрополис',
    'лига теней',
    'академия волшебства',
    'подгорный народ',
    'великая орда',
]

anec = '— Уже полдесятого, Сашенька. Тебе разве не пора заняться херой? — По часам только таблетки надо принимать. А ' \
       'постить кринж можно в любое время! '

position = [
    'верх лево',
    'верх право',
    'низ лево',
    'низ право',
]

# links to gifs
gif_sus = 'doc465630601_633778583'
gif_recruit_sus = 'doc465630601_638241402'
gif_potato_sus = 'doc465630601_638626230'
gif_salary = 'doc465630601_634236546'
gif_cold = 'doc465630601_634335482'
gif_free = 'doc465630601_634380794'
gif_pay = 'doc465630601_634329506'
gif_bravo = 'doc465630601_634380706'
gif_hedgehog = 'doc465630601_639105924'
gif_recruit = 'doc465630601_617879495'
gif_chop = 'doc465630601_635449078'
gif_modest = 'doc465630601_634271675'
gif_bad = 'doc465630601_642603896'

# links to img
img_carnage = 'photo-212138773_457239022'
img_kringe = 'photo-212138773_457239023'
img_zombi = 'photo-212138773_457239032'

# sticker id
stick_clown = 60804
